## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.log_analytics.azurerm_monitor_data_collection_rule.container_logs will be created
  + resource "azurerm_monitor_data_collection_rule" "container_logs" {
      + id                  = (known after apply)
      + immutable_id        = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "container-logs-dcr-dev"
      + resource_group_name = "huggingface-dev"

      + data_flow {
          + destinations = [
              + "container-logs-destination",
            ]
          + streams      = [
              + "Microsoft-ContainerLogV2",
            ]
        }

      + data_sources {
          + extension {
              + extension_name     = "ContainerLogV2"
              + input_data_sources = [
                  + "containerLogV2",
                ]
              + name               = "ContainerLogV2"
              + streams            = [
                  + "Microsoft-ContainerLogV2",
                ]
            }
        }

      + destinations {
          + log_analytics {
              + name                  = "container-logs-destination"
              + workspace_resource_id = "/subscriptions/61062400-6438-46d6-8bef-81f3a78fc9b4/resourceGroups/huggingface-dev/providers/Microsoft.OperationalInsights/workspaces/law-aks-dev-830ofj"
            }
        }
    }

  # module.log_analytics.azurerm_monitor_data_collection_rule_association.container_logs will be created
  + resource "azurerm_monitor_data_collection_rule_association" "container_logs" {
      + data_collection_rule_id = (known after apply)
      + description             = "Association for container logs collection"
      + id                      = (known after apply)
      + name                    = "container-logs-dcra-dev"
      + target_resource_id      = "/subscriptions/61062400-6438-46d6-8bef-81f3a78fc9b4/resourceGroups/huggingface-dev/providers/Microsoft.ContainerService/managedClusters/huggingface-aks-dev-830ofj"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>